onepas/cc3220-examples/rtos/CC3220S_LAUNCHXL/demos/mqtt_client_server/mqtt_server_app.c
        switch (queueElemRecv.event)
        {
            case PUBLISH_PUSH_BUTTON_PRESSED:

                /* send publish message                                       */
                lRetVal = MQTTClient_publish(gMqttClient, (char*) publish_topic, strlen((char*)publish_topic), (char*)publish_data, strlen((char*) publish_data), MQTT_QOS_2 | ((RETAIN_ENABLE)?MQTT_PUBLISH_RETAIN:0) );

                UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
                UART_PRINT("Topic: %s\n\r", publish_topic);
                UART_PRINT("Data: %s\n\r", publish_data);

                /* Clear and enable again the SW2 interrupt */
                GPIO_clearInt(Board_BUTTON0); // SW2
                GPIO_enableInt(Board_BUTTON0); // SW2

                break;

                /* msg received by server (on the enrolled topic by on-board  */
                /* client) publish it to the remote broker                    */
            case MSG_RECV_BY_SERVER:
                if (gUiConnFlag == 0)
                {
                    free(queueElemRecv.msgPtr);
                    memPtrCounterfree++;
                    break;
                }

                memcpy(&msgHead, queueElemRecv.msgPtr, sizeof(msgHead));
                uiTopOffset = sizeof(msgHead);
                uiPayloadOffset = uiTopOffset + msgHead.topicLen + 1;
                flags = msgHead.qos;
                if(msgHead.retain)
                {
                    flags = flags | MQTT_PUBLISH_RETAIN;
                }

                lRetVal = MQTTClient_publish(gMqttClient, ((char *) (queueElemRecv.msgPtr) + uiTopOffset), strlen(((char *) (queueElemRecv.msgPtr) + uiTopOffset)), ((char*) (queueElemRecv.msgPtr) + uiPayloadOffset), msgHead.payLen, flags);
                free(queueElemRecv.msgPtr);
                memPtrCounterfree++;
                break;

                /* msg received by client from remote broker (on a topic      */
                /* subscribed by local client)                                */
            case MSG_RECV_BY_CLIENT:
                {
                    flags = msgHead.qos;
                    if(msgHead.retain)
                    {
                        flags = flags | MQTT_PUBLISH_RETAIN;
                    }
                    memcpy(&msgHead, queueElemRecv.msgPtr, sizeof(msgHead));
                    uiTopOffset = sizeof(msgHead);
                    uiPayloadOffset = uiTopOffset + msgHead.topicLen + 1;
                    MQTTServer_publish(gMqttServer, ((char*) (queueElemRecv.msgPtr) + uiTopOffset), strlen(((char*) (queueElemRecv.msgPtr) + uiTopOffset)), ((char*) (queueElemRecv.msgPtr) + uiPayloadOffset), msgHead.payLen, flags);
                    free(queueElemRecv.msgPtr);
                    memPtrCounterfree++;
                }
                break;

                /* On-board client disconnected from remote broker, only      */
                /* local MQTT network will work                               */
            case LOCAL_CLIENT_DISCONNECTION:
                UART_PRINT("\n\rOn-board Client Disconnected\n\r");
                UART_PRINT("In order to reconnect local client, Reset board.\n\r\n\r");
                gUiConnFlag = 0;
                break;

                /* Remote client disconnected from local broker               */
                /* local MQTT network continue to work                        */
            case REMOTE_CLIENT_DISCONNECTION:
                UART_PRINT("\n\rRemote Client Disconnected\n\r\n\r");
                break;                

                /* Push button for full restart check                         */
            case DISC_PUSH_BUTTON_PRESSED:
                gResetApplication = true;
                break;
                
            case THREAD_TERMINATE_REQ:
                gUiConnFlag = 0;
                pthread_exit(0);
                return NULL;
                
            default:
                sleep(1);
                break;
        }
    }
}

//*****************************************************************************
//
//! This function connect the MQTT device to an AP with the SSID which was 
//! configured in SSID_NAME definition which can be found in Network_if.h file, 
//! if the device can't connect to to this AP a request from the user for other 
//! SSID will appear.
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
int32_t Mqtt_IF_Connect()
{
    int32_t lRetVal;
    char SSID_Remote_Name[32];
    int8_t Str_Length;

    memset(SSID_Remote_Name, '\0', sizeof(SSID_Remote_Name));
    Str_Length = strlen(SSID_NAME);

    if (Str_Length)
    {
        /* Copy the Default SSID to the local variable                        */
        strncpy(SSID_Remote_Name, SSID_NAME, Str_Length);
    }

    /* Display Application Banner                                             */
    DisplayBanner(APPLICATION_NAME);

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    /* Reset The state of the machine                                         */
    Network_IF_ResetMCUStateMachine();

    /* Start the driver                                                       */
    lRetVal = Network_IF_InitDriver(ROLE_STA);
    if (lRetVal < 0)
    {
        UART_PRINT("Failed to start SimpleLink Device\n\r", lRetVal);
        return -1;
    }

    /* switch on Green LED to indicate Simplelink is properly up.             */
    GPIO_write(Board_LED2, Board_LED_ON);

    /* Start Timer to blink Red LED till AP connection                        */
    LedTimerConfigNStart();

    /* Initialize AP security params                                          */
    SecurityParams.Key = (signed char *) SECURITY_KEY;
    SecurityParams.KeyLen = strlen(SECURITY_KEY);
    SecurityParams.Type = SECURITY_TYPE;

    /* Connect to the Access Point                                            */
    lRetVal = Network_IF_ConnectAP(SSID_Remote_Name, SecurityParams);
    if (lRetVal < 0)
    {
        UART_PRINT("Connection to an AP failed\n\r");
        return -1;
    }

    /* Disable the LED blinking Timer as Device is connected to AP.           */
    LedTimerDeinitStop();

    /* Switch ON RED LED to indicate that Device acquired an IP.              */
    GPIO_write(Board_LED0, Board_LED_ON);

    sleep(1);

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

